{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "cropping": [[50, 20], [0, 0]], "name": "cropping2d_1", "trainable": true}, "class_name": "Cropping2D"}, {"config": {"output_shape_type": "raw", "output_shape": null, "arguments": {}, "trainable": true, "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"nb_col": 5, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1", "dim_ordering": "tf", "activation": "linear", "nb_filter": 24, "subsample": [1, 1], "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 5, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2", "dim_ordering": "tf", "activation": "linear", "nb_filter": 36, "subsample": [1, 1], "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3", "dim_ordering": "tf", "activation": "linear", "nb_filter": 48, "subsample": [1, 1], "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "W_regularizer": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_4", "dim_ordering": "tf", "activation": "linear", "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "W_regularizer": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_5", "dim_ordering": "tf", "activation": "linear", "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_4", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "activation": "linear", "bias": true, "output_dim": 100, "input_dim": 2176, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "activation": "linear", "bias": true, "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_3", "activation": "linear", "bias": true, "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_4", "activation": "linear", "bias": true, "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}