{"keras_version": "1.2.1", "config": [{"config": {"name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "output_shape": null, "trainable": true, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>h\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "nb_row": 5, "activation": "linear", "b_regularizer": null, "nb_filter": 24, "border_mode": "valid", "bias": true, "trainable": true, "nb_col": 5, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_2", "nb_row": 5, "activation": "linear", "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "bias": true, "trainable": true, "nb_col": 5, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "nb_row": 5, "activation": "linear", "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "bias": true, "trainable": true, "nb_col": 5, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_4", "nb_row": 3, "activation": "linear", "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_4", "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_5", "nb_row": 3, "activation": "linear", "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "bias": true, "trainable": true, "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_5", "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 100, "trainable": true, "input_dim": 896, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_2", "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 50, "trainable": true, "input_dim": 100, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_3", "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 10, "trainable": true, "input_dim": 50, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_8", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_4", "activation": "linear", "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 1, "trainable": true, "input_dim": 10, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}