{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "cropping2d_1", "cropping": [[50, 20], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"function_type": "lambda", "output_shape": null, "arguments": {}, "name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "nb_col": 5, "bias": true, "W_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 24, "trainable": true, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "nb_col": 5, "bias": true, "W_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 36, "trainable": true, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_col": 5, "bias": true, "W_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 48, "trainable": true, "nb_row": 5, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "nb_col": 3, "bias": true, "W_constraint": null, "name": "convolution2d_4", "b_regularizer": null, "nb_filter": 64, "trainable": true, "nb_row": 3, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "nb_col": 3, "bias": true, "W_constraint": null, "name": "convolution2d_5", "b_regularizer": null, "nb_filter": 64, "trainable": true, "nb_row": 3, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_4", "border_mode": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias": true, "output_dim": 100, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_dim": 2176, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "output_dim": 50, "W_constraint": null, "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_dim": 100, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "output_dim": 10, "W_constraint": null, "name": "dense_3", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_dim": 50, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "output_dim": 1, "W_constraint": null, "name": "dense_4", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_dim": 10, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}