{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "input_dtype": "float32", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>:\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_1", "nb_filter": 24, "trainable": true, "nb_col": 5, "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_2", "nb_filter": 36, "trainable": true, "nb_col": 5, "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "trainable": true, "nb_col": 5, "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "trainable": true, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "nb_row": 3, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "trainable": true, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "nb_row": 3, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "trainable": true, "activation": "linear", "activity_regularizer": null, "input_dim": 896, "init": "glorot_uniform", "W_constraint": null, "bias": true, "output_dim": 240, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "trainable": true, "activation": "linear", "activity_regularizer": null, "input_dim": 240, "init": "glorot_uniform", "W_constraint": null, "bias": true, "output_dim": 120, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_3", "trainable": true, "activation": "linear", "activity_regularizer": null, "input_dim": 120, "init": "glorot_uniform", "W_constraint": null, "bias": true, "output_dim": 20, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_4", "trainable": true, "activation": "linear", "activity_regularizer": null, "input_dim": 20, "init": "glorot_uniform", "W_constraint": null, "bias": true, "output_dim": 1, "W_regularizer": null, "b_regularizer": null}}], "keras_version": "1.2.1"}