{"config": [{"config": {"name": "cropping2d_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[60, 20], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}, "class_name": "Lambda"}, {"config": {"nb_col": 5, "subsample": [1, 1], "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "nb_filter": 24, "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 5, "subsample": [1, 1], "W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "nb_filter": 36, "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "subsample": [1, 1], "W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 100, "name": "dense_1", "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 2176}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 50, "name": "dense_2", "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 10, "name": "dense_3", "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "output_dim": 1, "name": "dense_4", "trainable": true, "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}