{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>9\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "arguments": {}, "name": "lambda_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "output_shape": null, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "border_mode": "valid", "nb_row": 5, "nb_filter": 24, "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "border_mode": "valid", "nb_row": 5, "nb_filter": 36, "W_constraint": null, "name": "convolution2d_2", "nb_col": 5, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "border_mode": "valid", "nb_row": 5, "nb_filter": 48, "W_constraint": null, "name": "convolution2d_3", "nb_col": 5, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "border_mode": "valid", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_4", "nb_col": 3, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "border_mode": "valid", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_5", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "output_dim": 240, "trainable": true, "input_dim": 896, "b_regularizer": null, "activation": "linear", "W_constraint": null, "name": "dense_1", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "output_dim": 120, "trainable": true, "input_dim": 240, "b_regularizer": null, "activation": "linear", "W_constraint": null, "name": "dense_2", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "output_dim": 20, "trainable": true, "input_dim": 120, "b_regularizer": null, "activation": "linear", "W_constraint": null, "name": "dense_3", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_8", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "trainable": true, "input_dim": 20, "b_regularizer": null, "activation": "linear", "W_constraint": null, "name": "dense_4", "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}