{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[60, 20], [0, 0]], "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\tmodel1.py\u00da\b<lambda>\u00a8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "dim_ordering": "tf", "W_constraint": null, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_col": 5, "nb_filter": 24, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "dim_ordering": "tf", "W_constraint": null, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_col": 5, "nb_filter": 36, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "dim_ordering": "tf", "W_constraint": null, "nb_row": 5, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_col": 5, "nb_filter": 48, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "dim_ordering": "tf", "W_constraint": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_col": 3, "nb_filter": 64, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "dim_ordering": "tf", "W_constraint": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_col": 3, "nb_filter": 64, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_4", "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "input_dim": 2176, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "output_dim": 50, "b_constraint": null, "b_regularizer": null, "input_dim": 100, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dense", "config": {"name": "dense_3", "W_constraint": null, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "input_dim": 50, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dense", "config": {"name": "dense_4", "W_constraint": null, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "input_dim": 10, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true}}]}